package Recursion;

import java.util.Random;

public class Classwork {
    /*
Вывести паттерн
1*1=
11*11=
...
Действия выровнять по знаку "равно"
 */
/*
Вывести паттерн
5*5=
5*55=
...
Действия выровнять по знаку "равно"
 */
/*
1*8+1=9
12*8+2=98
...

 */
    /*
Быки и коровы
0123456789
4239
Пользователь вводит 4 цифры
4567
Компьютер отвечает: 1 бык, 0 коров
5467
Компьютер отвечает: 0 бык, 1 корова

 */
    public static void main(String[] args) {

    }
    static void compAI (){
        Random random = new Random();
    }
}
