package Homework.Homework5;

public class Task4_4 {
    /*
    Определить, в какую из областей — I или II (рис. 4.2) — попадает точка с заданными координатами. Для простоты принять, что точка не попадает на границу областей.
     */
    public static void main(String[] args) {
        double y=3.5;
        System.out.println(y>3?"область 1":"область 2");

    }

}
