package Homework.Homework5;

public class Task4_21 {
    /*
    Определить, является ли число a делителем числа b?

     */
    public static void main(String[] args) {
        int a=2, b=6;
        if (b%a==0)
            System.out.println("Является b/a");
        else
            System.out.println("Не является b/a");
    }
}
