package Homework.Homework5;

public class Task4_18 {
    /*
    *Даны два прямоугольника, стороны которых параллельны или перпендикулярны осям координат. Известны координаты левого нижнего и правого нижнего углов каждого из них. Найти координаты левого нижнего и правого
верхнего углов минимального прямоугольника, содержащего указанные прямоугольники
     */
    public static void main(String[] args) {
        int x1=3,y1=2,x2=5, y2=2; // угол 1 прямоугольника
        int a1=7,b1=9, a2=10,b2=9; // угол 2 прямоугольника
        //  некорректное условие
    }
}
